Revit 2026 API

# ElectricalSystemTrueCurrentPhaseC Property

---

The TrueCurrentPhaseC value of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double TrueCurrentPhaseC { get; }
```
```vb
Public ReadOnly Property TrueCurrentPhaseC As Double
	Get
```
```cpp
public:
property double TrueCurrentPhaseC {
	double get ();
}
```
```fsharp
member TrueCurrentPhaseC : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

This property is used to retrieve the TrueCurrentPhaseC value of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace